Microchip-MPLAB-Harmony/wireless_pic32cxbz_wbz/driver/pic32cx-bz/src/src_bz3/btl/dfu/src/progexec.c
/*******************************************************************************
* Copyright (C) 2022 Microchip Technology Inc. and its subsidiaries.
*
* Subject to your compliance with these terms, you may use Microchip software
* and any derivatives exclusively with Microchip products. It is your
* responsibility to comply with third party license terms applicable to your
* use of third party software (including open source software) that may
* accompany Microchip software.
*
* THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER
* EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED
* WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND FITNESS FOR A
* PARTICULAR PURPOSE.
*
* IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE,
* INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND
* WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS
* BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE
* FULLEST EXTENT ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN
* ANY WAY RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
* THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
*******************************************************************************/


#include <xc.h>
#include <string.h>
#include <stdlib.h>
#include "dfu/pe/include/progexec.h"
//#include "spi/drv_spi.h"
#include "dfu/pe/include/uart.h"
#include "mem_interface.h"
//#include "helper.h"
/******************************************************************************
 Global Data
******************************************************************************/

#define GET_PE_COMMAND(buffer,len) UART_Read(buffer, len, PE_CMD_TIMEOUT)
#define SET_PE_RESPONSE(buffer,size) UART_Write(buffer, size)

//static uint8_t vBuf[4096];

/* PE version number embedded in the binary code */
/* Not used in PE code, but keep it in hex file to be able to tell the version
 from the hex file */
const uint16_t PEVersion[] = {PROG_EXEC_VNUM_IDENTIFIER, 
        PROG_EXEC_VERSION_NUMBER};

/* other globals */
uint32_t row[ROW_SIZE] __attribute__ ((aligned (4)));

/* scratch buffer used for flash verification commands */
uint32_t scratch_size = PE_CMD_PAYLOAD_SIZE;
/******************************************************************************
 Function Prototypes
******************************************************************************/
static uint16_t prog (const uint8_t *dataAddr, const uint32_t address, 
        const uint32_t len, IMG_MEM_WRITE pfWrite );     
static uint16_t getCRC(const uint8_t * addr, uint32_t len, 
        uint32_t * const hwCrc, IMG_MEM_READ pfRead );
static uint16_t getCsum(const uint8_t *addr, uint32_t len, 
        uint32_t * const csum, IMG_MEM_READ pfRead);
static const IMG_MEM_TOPOLOGY * getDeviceTop(const uint32_t startAddr, 
        const uint32_t endAddr, const IMG_MEM_TOPOLOGY ** tops, 
        const uint8_t count);
static uint32_t *read_from_scratch(const uint32_t addr, uint8_t * buf, const uint32_t size, 
        IMG_MEM_READ pfRead);
static uint32_t virt_to_phy(const uint32_t addr, const IMG_MEM_TOPOLOGY *top);

/* erase chip */
static uint16_t eraseChip(const FPP_CMD_PACKET *pCmd, 
        const IMG_MEM_TOPOLOGY *pDeviceTop); 
static uint16_t pageErase(const FPP_CMD_PACKET *pCmd, 
        const IMG_MEM_TOPOLOGY *pDeviceTop); 

/* program flash */
static uint16_t programClusterVerify (const FPP_CMD_PACKET *pCmd, 
        const IMG_MEM_TOPOLOGY *pDeviceTop); 

/* Verify blank check*/
static uint16_t blankCheck(const FPP_CMD_PACKET *pCmd, 
        const IMG_MEM_TOPOLOGY *pDeviceTop);

//uint8_t pe_command[PE_CMD_SIZE];
uint8_t *pe_command;
int8_t pe_resp[PE_RESP_SIZE+20];
/******************************************************************************
 main
 This is the entry point for the programming executive. It receives commands
 from the host, dispatches the command, and then sends response back to 
 the host.
******************************************************************************/
    uint32_t incmd;
    FPP_CMD_PACKET Cmd;
int32_t program_exec_main(const IMG_MEM_TOPOLOGY ** tops, uint8_t count)
{
    uint16_t retval;
    volatile uint32_t *sram_cmd_addr = 0;
    const IMG_MEM_TOPOLOGY *pDeviceTop = 0;
    uint32_t respSize = 0;

    pe_command = (uint8_t *)malloc(PE_CMD_SIZE);
    if( pe_command == NULL )
    {
      while(1);
    }
    
    UART_Init();
    
    while(1)
    {
        /* read command */        
        if (GET_PE_COMMAND(pe_command, PE_CMD_SIZE) <= 0)
            continue;

        sram_cmd_addr =  (uint32_t *)pe_command;
        incmd = *sram_cmd_addr++;

        /* read command and operand from command address */       
        Cmd.cmd = CMD( incmd );
        Cmd.operand = LEN( incmd );
        
        retval = FAIL_RESP;
        /* dispatch commands */   
        switch( Cmd.cmd )
        { 
        case EXEC_VERSION_CMD:
            retval = PROG_EXEC_VERSION_NUMBER;   
            break;  
        case GET_DEVICEID:
            retval = PASS_RESP;
            break;
        case PAGE_ERASE_CMD:
            Cmd.erasePage.addr = (void *)*sram_cmd_addr; 
            pDeviceTop = getDeviceTop((uint32_t)Cmd.erasePage.addr, 
                    (uint32_t)Cmd.erasePage.addr, tops, count);
            if (pDeviceTop)
            {
                retval = pageErase(&Cmd, pDeviceTop);   
            }
            break;
        case CHIP_ERASE_CMD:
            Cmd.eraseChip.addr = (void *)*sram_cmd_addr; 
            pDeviceTop = getDeviceTop((uint32_t)Cmd.eraseChip.addr, 
                    (uint32_t)Cmd.eraseChip.addr, tops, count);
            if (pDeviceTop)
            {
                retval = eraseChip(&Cmd, pDeviceTop);   
            }
            break;
        case PROG_CLUSTER_VERIFY_CMD:
            Cmd.progClusterVerify.addr = (void *) *sram_cmd_addr++;
            Cmd.progClusterVerify.len = (uint32_t)*sram_cmd_addr++;
            Cmd.progClusterVerify.checksum = (uint32_t)*sram_cmd_addr++;   
            Cmd.progClusterVerify.payload = (void *)sram_cmd_addr;
            pDeviceTop = getDeviceTop((uint32_t)Cmd.progClusterVerify.addr,
                    (uint32_t)(Cmd.progClusterVerify.addr+
                    Cmd.progClusterVerify.len), tops, count);
            
            if (pDeviceTop)
            {
                retval = programClusterVerify(&Cmd, pDeviceTop);
            }
            break;            
        case BLANK_CHECK_CMD:
            Cmd.blanckCheck.addr = (void *) *sram_cmd_addr++;;
            Cmd.blanckCheck.len = (uint32_t) *sram_cmd_addr;
            pDeviceTop = getDeviceTop((uint32_t)Cmd.blanckCheck.addr, 
                    (uint32_t)(Cmd.blanckCheck.addr+Cmd.blanckCheck.len), 
                    tops, count);  
            if (pDeviceTop)
            {
                retval = blankCheck(&Cmd, pDeviceTop);
            }
            break;
        default:  
            retval = NACK_RESP;
            break;  

        } /* end of switch */
        respSize = PE_RESP_SIZE;      
        if( Cmd.cmd == EXEC_VERSION_CMD || Cmd.cmd == GET_DEVICEID )
        {
            //*( (volatile uint32_t *) PE_RESP_SRAM_ADDR  ) = 
            //        ( ( (Cmd.cmd) << 16 ) | (uint16_t) retval );
            *((volatile uint32_t *) pe_resp ) = 
                    ( ( (Cmd.cmd) << 16 ) | (uint16_t) retval );
            
            if ( Cmd.cmd == GET_DEVICEID )
            {
                uint32_t devID = 0;
#ifdef DEVID
                devID = DEVID; //PE_DEVICEID(DEVID); 
#endif 
                //*( (volatile uint32_t *) PE_RESP_SRAM_ADDR + 1 ) = devID;   
                *( (volatile uint32_t *) pe_resp + 1 ) = devID; 
                respSize += 4;
            }            
        }
        else {
            /* send response for most commands */
            //*( (volatile uint32_t *)PE_RESP_SRAM_ADDR ) = ( (Cmd.cmd) << 16 ) | 
            //        ( ( retval <= NACK_RESP ) ? retval : FAIL_RESP );
            *( (volatile uint32_t *) pe_resp ) = ( (Cmd.cmd) << 16 ) | 
                    ( ( retval <= NACK_RESP ) ? retval : FAIL_RESP );
        }

        SET_PE_RESPONSE(pe_resp, respSize); 
   } /* end of while */
   
   return 0;
   
} /* end of main */

/******************************************************************************
* Function: programClusterVerify
* This routine programs the specified number of bytes to the specified address. 
* The address must be 32-bit aligned, and the number of bytes must be a
* multiple of a 32-bit word.
*
* PreCondition:    none.
*
* Input:    pCmd  - Command data to program/verify in the device memory 
*           | CMD:Operand | Address | Length | Checksum | Payload[] | 
* 
*           pDeviceTop - Valid device topology based on command address.          
*
* Output:   PASS_RESP - if everything is OK.
*           FAIL_RESP - otherwise.
*
* Side Effects:   None
*
* Overview: None
* Note:     None
******************************************************************************/
static uint16_t programClusterVerify (const FPP_CMD_PACKET *pCmd, 
        const IMG_MEM_TOPOLOGY *pDeviceTop)
{
    uint8_t *dataAddr;      /* command data */
    uint32_t destAddr;         /* flash/sram address */
    uint32_t len;           /* data length to program */
    uint16_t checksumMethod;/* checksum method to use */
    uint32_t cmdChecksum;   /* checksum value from PC */ 
    uint32_t checksum = 0;  /* checksum value computed by PE */
    
    if (!pCmd)
        return FAIL_RESP;
    
    dataAddr = (uint8_t *)pCmd->progClusterVerify.payload;
    destAddr =  virt_to_phy((uint32_t)pCmd->progClusterVerify.addr, pDeviceTop);
    len = pCmd->progClusterVerify.len;
    checksumMethod = pCmd->operand;
    cmdChecksum = pCmd->progClusterVerify.checksum;    

    if (pDeviceTop->ifFlash && pDeviceTop->ifFlash->fInit)
        pDeviceTop->ifFlash->fInit();    
    
   if (PASS_RESP != prog(dataAddr, destAddr, len, 
           (pDeviceTop->ifFlash?pDeviceTop->ifFlash->fWrite:0)))
       return FAIL_RESP;
   
    if (checksumMethod == PE_CFG_CHECKSUM)
    {
        getCsum((uint8_t *)destAddr, len, &checksum, 
                (pDeviceTop->ifFlash?pDeviceTop->ifFlash->fRead:0));
    }
    else if (checksumMethod == PE_CFG_CRC)
    {
        getCRC((uint8_t *)destAddr, len, &checksum, 
                (pDeviceTop->ifFlash?pDeviceTop->ifFlash->fRead:0));
    }
    
    if (checksum != cmdChecksum)
       return FAIL_RESP;
       
   return PASS_RESP;
}

/******************************************************************************
* Function: eraseChip
* This function erases the entire flash memory.
*
* PreCondition:    none.
*
* Input:    pCmd  - Command data to program/verify in the device memory 
*           | CMD:Operand | Address |
* 
*           pDeviceTop - Valid device topology based on command address.          
*
* Output:   PASS_RESP - if everything is OK.
*           FAIL_RESP - otherwise.
*
* Side Effects:   None
*
* Overview: None
* Note:     None
******************************************************************************/
static uint16_t eraseChip(const FPP_CMD_PACKET *pCmd, 
        const IMG_MEM_TOPOLOGY *pDeviceTop)
{
    uint32_t addr;
    uint16_t pageCount;
    uint32_t len;
    uint16_t retval = PASS_RESP;
    
    if (!pCmd)
        return FAIL_RESP;
    
    addr = (uint32_t)pCmd->erasePage.addr;
    pageCount = (pDeviceTop->u32CalIdx / pDeviceTop->u16ErasePageSz);
    len = (pageCount * pDeviceTop->u16ErasePageSz);
    if ((pDeviceTop->u32UmmAddrStart + len) > (pDeviceTop->u32UmmAddrStart + pDeviceTop->u32CalIdx))
        return FAIL_RESP;

    if (pDeviceTop->ifFlash && pDeviceTop->ifFlash->fInit)
        pDeviceTop->ifFlash->fInit();
    
    addr =  virt_to_phy(pDeviceTop->u32UmmAddrStart, pDeviceTop);
    if (pDeviceTop->ifFlash && pDeviceTop->ifFlash->fErase)
    {
        retval = pDeviceTop->ifFlash->fErase(addr, pageCount);
    }
    else
    {
        //rom_memset32((uint32_t *)addr, 0x00000000, len/4);
    }
    
    return retval;
}

/******************************************************************************
* Function: blankCheck
* This function checks if specified length of flash memory is blank or not.
*
* PreCondition:    none.
*
* Input:    pCmd  - Command data to program/verify in the device memory 
*           | CMD:Operand | Address | Length | 
* 
*           pDeviceTop - Valid device topology based on command address.          
*
* Output:   PASS_RESP - if everything is OK.
*           FAIL_RESP - otherwise.
*
* Side Effects:   None
*
* Overview: None
* Note:     None
******************************************************************************/
static uint16_t blankCheck(const FPP_CMD_PACKET *pCmd, 
        const IMG_MEM_TOPOLOGY *pDeviceTop)
{
    uint32_t addr;
    uint32_t len;
    uint8_t *pBuf, *pBuf2;
	uint32_t size;
//    uint32_t result = 0;
    uint32_t u32BlankCheck;
    
    if (!pCmd && !pDeviceTop)
        return FAIL_RESP;
    
    if (pDeviceTop->ifFlash && pDeviceTop->ifFlash->fInit)
        pDeviceTop->ifFlash->fInit();
    
    addr = (uint32_t)pCmd->blanckCheck.addr;
    addr =  virt_to_phy(addr, pDeviceTop);
    len = pCmd->blanckCheck.len;
    u32BlankCheck = pDeviceTop->u32BlankCheck;    
    
    while (len) {
        
        if (len > scratch_size)
            size = scratch_size;
        else
            size = len;
        
        pBuf = malloc(size);
        if( pBuf == NULL )
          return FAIL_RESP;
        pBuf2 = pBuf;
        
        read_from_scratch((uint32_t)addr, pBuf, size, 
                (IMG_MEM_READ)(pDeviceTop->ifFlash?pDeviceTop->ifFlash->fRead:0));                
        
        addr += size;
        len -= size;
        size /= 4;

        while(size--)
        {
            if (*pBuf++ != u32BlankCheck)
            {
                free(pBuf2);
                return FAIL_RESP;
            }
        }
        free(pBuf2);
    }
    
   return PASS_RESP; 
}
/******************************************************************************
* Function: getCRC
* This function calculates the CRC of the locations starting with the
* specified address upto the specified length.
*
* PreCondition: none.
*
* Input:    addr - is the address where to begin CRC calculations.
*           len -  is the length in bytes of the buffer whose CRC
*                  needs to be calculated
*           pfRead - API to read from device interface
*
* Output:   crc - computed CRC value
*           PASS_RESP - if everything is OK.
*           FAIL_RESP - otherwise.
*
* Side Effects:   None
*
* Overview: None
* Note:     None
******************************************************************************/
static uint16_t getCRC(const uint8_t *addr, uint32_t len, 
        uint32_t * const crc, IMG_MEM_READ pfRead )
{
    uint32_t seed;         // initial seed
    uint8_t *pBuf;
    uint32_t size = 0;
        
    seed=0xffff;
    Crc32Init( seed );
      
    while (len) {
        
        if (len > scratch_size)
            size = scratch_size;
        else
            size = len;
        
        pBuf = malloc(size);
        if( pBuf == NULL )
          return FAIL_RESP;
        read_from_scratch((uint32_t)addr, pBuf, size, pfRead);                
        
        addr += size;
        len -= size;

        Crc32Add(pBuf, size );
        free(pBuf);
    }      

    *crc = (uint32_t) Crc32Result();

    return PASS_RESP;
}

/******************************************************************************
* Function: getCsum
* This function calculates the checksum of the locations starting with the
* specified address upto the specified length. 
*
* PreCondition: none.
*
* Input:    addr - is the address where to begin Checksum calculations.
*           len -  is the length in bytes of the buffer whose CRC
*                  needs to be calculated
*           pfRead - API to read from device interface
*
* Output:   csum - computed CRC value
*           PASS_RESP - if everything is OK.
*           FAIL_RESP - otherwise.
*
* Side Effects:   None
*
* Overview: None
* Note:     None
******************************************************************************/
static uint16_t getCsum(const uint8_t *addr, uint32_t len, 
        uint32_t * const csum, IMG_MEM_READ pfRead)
{
    uint8_t *pBuf, *pBuf2;
    uint32_t size;
    uint32_t result = 0; 
            
    while (len) {
        
        if (len > scratch_size)
            size = scratch_size;
        else
            size = len;
        
        pBuf = malloc(size);
        if( pBuf == NULL )
        {
          return FAIL_RESP;
        }
        pBuf2 = pBuf;
        read_from_scratch((uint32_t)addr, pBuf, size, pfRead);                
        
        addr += size;
        len -= size;

        while(size--)
        {
            result += (*pBuf++);
        }

        free(pBuf2);
    }
    
    *csum = result;
    
    return 0;
}
/*****************************************************************************
* Function: prog
* Program specified number of rows in parallel for optimized programming.
* The function receives all the bytes for the specified length, and then
* sends a status back to the host indicating if the entire operation
* succeeded or something failed. 
*
* PreCondition:    none.
*
* Input:    address - is the address where to begin CRC calculations.
*           len -  is the length in bytes of the buffer whose CRC
*                  needs to be calculated
*           dataAddr - command payload address
*           pfWrite - API to write from device interface
*
* Output:   PASS_RESP - if everything is OK.
*           FAIL_RESP - otherwise.
*
* Side Effects:   None
*
* Overview: None
* Note:     None
******************************************************************************/
static uint16_t prog (const uint8_t *dataAddr, const uint32_t address, 
        const uint32_t len, IMG_MEM_WRITE pfWrite )
{
    uint16_t retval = PASS_RESP;
    if (pfWrite)
    {
        retval = pfWrite((uint8_t *)dataAddr, (uint32_t)address, (uint32_t)len); 	
    }
    else
    {
        //rom_memcpy32((uint32_t *)address, (uint32_t *)dataAddr, len/4);
    }
    
    return retval;
}

static const IMG_MEM_TOPOLOGY * getDeviceTop(const uint32_t startAddr, 
        const uint32_t endAddr, const IMG_MEM_TOPOLOGY ** tops, 
        const uint8_t count)
{
    uint32_t i;
    
    for (i = 0; i < count; i++)
    {
        if ((startAddr >= tops[i]->u32UmmAddrStart) && (endAddr <= 
                (tops[i]->u32UmmAddrStart + tops[i]->u32CalIdx)))
            return (const IMG_MEM_TOPOLOGY *)tops[i];
    }
    return (const IMG_MEM_TOPOLOGY * )0;
}
/******************************************************************************
* Function: blankCheck
* This function erase the specified number of pages from flash.
*
* PreCondition:    none.
*
* Input:    pCmd  - Command data to program/verify in the device memory 
*           | CMD:Operand | Address |
* 
*           pDeviceTop - Valid device topology based on command address.          
*
* Output:   PASS_RESP - if everything is OK.
*           FAIL_RESP - otherwise.
*
* Side Effects:   None
*
* Overview: None
* Note:     None
******************************************************************************/
static uint16_t pageErase(const FPP_CMD_PACKET *pCmd, 
        const IMG_MEM_TOPOLOGY *pDeviceTop)
{
    uint32_t addr;
    uint16_t pageCount;
    uint32_t len;
    uint16_t retval = PASS_RESP;
    
    if (!pCmd)
        return FAIL_RESP;
    
    addr = (uint32_t)pCmd->erasePage.addr;
    pageCount = (uint16_t)pCmd->operand;
    len = (pageCount * pDeviceTop->u16ErasePageSz);
    if ((addr + len) >= (pDeviceTop->u32UmmAddrStart + pDeviceTop->u32CalIdx))
        return FAIL_RESP;

    if (pDeviceTop->ifFlash && pDeviceTop->ifFlash->fInit)
        pDeviceTop->ifFlash->fInit();
    
    addr =  virt_to_phy(addr, pDeviceTop);
    if (pDeviceTop->ifFlash && pDeviceTop->ifFlash->fErase)
    {
        retval = pDeviceTop->ifFlash->fErase(addr, pageCount);
    }
    else
    {
        //rom_memset32((uint32_t *)addr, 0x00000000, len/4);
    }
    
    return retval;
}
    
static uint32_t virt_to_phy(const uint32_t addr, const IMG_MEM_TOPOLOGY *top) 
{
    return  ((addr | top->u32AddrPosMask) & top->u32AddrNegMask);
}

/******************************************************************************
* Function: read_from_scratch
* This function aid blankcheck/crc/cheksum methods to perform temporary read 
* flash content to scratch buffer
*
* PreCondition:    none.
*
* Input:    addr -  address from where contents are read
*           size -  size of buffer to read
*           pfRead - device interface read function.          
*
* Output:   PASS_RESP - if everything is OK.
*           FAIL_RESP - otherwise.
*
* Side Effects:   This fun re-use the command buffer, calling prior to handling 
*                 command may invalidate command buffer.
* Overview: None
* Note:     None
******************************************************************************/
static uint32_t *read_from_scratch(const uint32_t addr, uint8_t *pBuf, const uint32_t size, 
        IMG_MEM_READ pfRead)
{
    if (pfRead)
    {
        memset(pBuf, 0, size);
        //rom_memset32(pBuf, 0, scratch_size/4); 
        if (pfRead(0, (uint8_t *)pBuf, (uint32_t)addr, size))
            return (uint32_t *)0;    
    }
    else
    {
        pBuf = (uint8_t *) addr; /* allowing in-place read */
    }

    return (uint32_t *) pBuf;
}
